lecture-11/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-21 Mon 16:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vincent" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4edb5e8">1. What to do with medium-sized Data</a></li>
<li><a href="#orgd99a952">2. SQL &amp; SQLite</a></li>
<li><a href="#orgc6cecf9">3. Why SQLite</a></li>
<li><a href="#orgd3e57f0">4. SQL Basics</a></li>
<li><a href="#org0a0ab54">5. Creating a Databases</a></li>
<li><a href="#org47db2d1">6. Our Headers</a></li>
<li><a href="#org6c0553d">7. Basic SQL</a></li>
<li><a href="#org44e7b92">8. SELECT</a></li>
<li><a href="#orgc39003f">9. Accessing SQLite from R</a></li>
<li><a href="#orgb3b4906">10. Docker</a></li>
<li><a href="#org6493eb4">11. In R</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4edb5e8" class="outline-2">
<h2 id="org4edb5e8"><span class="section-number-2">1</span> What to do with medium-sized Data</h2>
<div class="outline-text-2" id="text-1">
<p>
You might find yourself with a dataset that is too big to fit in
RAM. Even if you can squeeze the entire thing into RAM you might have
trouble doing joins or other manipulation.
</p>

<p>
What now?
</p>

<ol class="org-ol">
<li>Get on AWS and set up a machine with a lot of RAM. (Luckily you've
got your project dockerized so you don't have to waste any time
setting up the machine apart from getting Docker running).</li>
<li>Create a local sqlite3 database and do your initial analysis steps
via SQL.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd99a952" class="outline-2">
<h2 id="orgd99a952"><span class="section-number-2">2</span> SQL &amp; SQLite</h2>
<div class="outline-text-2" id="text-2">
<p>
SQLite is ancient technology but digital standards - it almost exactly 20
years old.
</p>

<p>
SQL itself is 46 years old!
</p>

<p>
There is an enormous strength and solidity to technology this old. It
wouldn't still be around if it wasn't at least a very solid local
maximum.
</p>

<p>
There are many SQL databases and there are minor differences in the
dialects of SQL they provide.
</p>
</div>
</div>

<div id="outline-container-orgc6cecf9" class="outline-2">
<h2 id="orgc6cecf9"><span class="section-number-2">3</span> Why SQLite</h2>
<div class="outline-text-2" id="text-3">
<p>
SQLite is absolutely simple to set up and maintain. It is a single
program and databases are represented as a single, regular,
file. Despite this, it provides an almost full, modern, SQL
experience. For data scientists, for whom many properties of SQL are
unimportant, its a perfect back up plan for maniplating large-ish
data.
</p>
</div>
</div>

<div id="outline-container-orgd3e57f0" class="outline-2">
<h2 id="orgd3e57f0"><span class="section-number-2">4</span> SQL Basics</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>You know the ideas already: tables, selection, filtration, joins.</li>
<li>The main difference is that EVERYTHING in SQL is a table</li>
<li>All you do is run expressions which, in one way or another, give
you a table.</li>
</ol>

<p>
We'll do some examples after we set up our database.
</p>
</div>
</div>

<div id="outline-container-org0a0ab54" class="outline-2">
<h2 id="org0a0ab54"><span class="section-number-2">5</span> Creating a Databases</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Understand the Scheme of the Data</li>
<li>Strip the headers from the files</li>
<li>Declare the Tables</li>
<li>Import the headerless csv files into the tables</li>
</ol>
</div>
</div>

<div id="outline-container-org47db2d1" class="outline-2">
<h2 id="org47db2d1"><span class="section-number-2">6</span> Our Headers</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #a020f0;">for</span> f<span style="color: #a020f0;"> in</span> <span style="color: #ff00ff;">`find source_data -iname "*.csv" -type f`</span>; <span style="color: #a020f0;">do</span> 
  <span style="color: #483d8b;">echo</span> $<span style="color: #a0522d;">f</span> columns:
  head -n1 $<span style="color: #a0522d;">f</span> 
  <span style="color: #483d8b;">echo</span> 
<span style="color: #a020f0;">done</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">source_data/superheroes_power_matrix.csv columns:
Name,Agility,Accelerated Healing,Lantern Power Ring,Dimensional Awareness,Cold Resistance,Durability,Stealth,Energy Absorption,Flight,Danger Sense,Underwater breathing,Marksmanship,Weapons Master,Power Augmentation,Animal Attributes,Longevity,Intelligence,Super Strength,Cryokinesis,Telepathy,Energy Armor,Energy Blasts,Duplication,Size Changing,Density Control,Stamina,Astral Travel,Audio Control,Dexterity,Omnitrix,Super Speed,Possession,Animal Oriented Powers,Weapon-based Powers,Electrokinesis,Darkforce Manipulation,Death Touch,Teleportation,Enhanced Senses,Telekinesis,Energy Beams,Magic,Hyperkinesis,Jump,Clairvoyance,Dimensional Travel,Power Sense,Shapeshifting,Peak Human Condition,Immortality,Camouflage,Element Control,Phasing,Astral Projection,Electrical Transport,Fire Control,Projection,Summoning,Enhanced Memory,Reflexes,Invulnerability,Energy Constructs,Force Fields,Self-Sustenance,Anti-Gravity,Empathy,Power Nullifier,Radiation Control,Psionic Powers,Elasticity,Substance Secretion,Elemental Transmogrification,Technopath/Cyberpath,Photographic Reflexes,Seismic Power,Animation,Precognition,Mind Control,Fire Resistance,Power Absorption,Enhanced Hearing,Nova Force,Insanity,Hypnokinesis,Animal Control,Natural Armor,Intangibility,Enhanced Sight,Molecular Manipulation,Heat Generation,Adaptation,Gliding,Power Suit,Mind Blast,Probability Manipulation,Gravity Control,Regeneration,Light Control,Echolocation,Levitation,Toxin and Disease Control,Banish,Energy Manipulation,Heat Resistance,Natural Weapons,Time Travel,Enhanced Smell,Illusions,Thirstokinesis,Hair Manipulation,Illumination,Omnipotent,Cloaking,Changing Armor,Power Cosmic,Biokinesis,Water Control,Radiation Immunity,Vision - Telescopic,Toxin and Disease Resistance,Spatial Awareness,Energy Resistance,Telepathy Resistance,Molecular Combustion,Omnilingualism,Portal Creation,Magnetism,Mind Control Resistance,Plant Control,Sonar,Sonic Scream,Time Manipulation,Enhanced Touch,Magic Resistance,Invisibility,Sub-Mariner,Radiation Absorption,Intuitive aptitude,Vision - Microscopic,Melting,Wind Control,Super Breath,Wallcrawling,Vision - Night,Vision - Infrared,Grim Reaping,Matter Absorption,The Force,Resurrection,Terrakinesis,Vision - Heat,Vitakinesis,Radar Sense,Qwardian Power Ring,Weather Control,Vision - X-Ray,Vision - Thermal,Web Creation,Reality Warping,Odin Force,Symbiote Costume,Speed Force,Phoenix Force,Molecular Dissipation,Vision - Cryo,Omnipresent,Omniscient

source_data/comics.csv columns:
comicID,title,issueNumber,description

source_data/marvel_characters_info.headless.csv columns:
0,A-Bomb,good,Male,yellow,Human,No Hair,Marvel Comics,-,203,441

source_data/charactersToComics.headless.csv columns:
16232,1009220

source_data/marvel_dc_characters.headless.csv columns:
100001,Claude Potier (Earth-616),Secret,Neutral,Hazel,Brown,Male,Living,2,\340\345\367-00,2000,DC

source_data/comics.headless.csv columns:
16232,Cap Transport (2005) <span style="color: #b22222;">#</span><span style="color: #b22222;">12,12,</span>

source_data/superheroes_power_matrix.headless.csv columns:
3-D Man,TRUE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,TRUE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,TRUE,FALSE,FALSE,FALSE,FALSE,TRUE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE,FALSE

source_data/characters.csv columns:
characterID,name

source_data/character_stats.headless.csv columns:
3-D Man,good,50,31,43,32,25,52,233

source_data/character_stats.csv columns:
Name,Alignment,Intelligence,Strength,Speed,Durability,Power,Combat,Total

source_data/characters.headless.csv columns:
1009220,Captain America

source_data/marvel_characters_info.csv columns:
ID,Name,Alignment,Gender,EyeColor,Race,HairColor,Publisher,SkinColor,Height,Weight

source_data/marvel_dc_characters.csv columns:
ID,Name,Identity,Alignment,EyeColor,HairColor,Gender,Status,Appearances,FirstAppearance,Year,Universe

source_data/charactersToComics.csv columns:
comicID,characterID

</pre>
</div>

<p>
Now we need to strip the headers from each file. We can do this with
the bash `tail` command.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #a020f0;">for</span> f<span style="color: #a020f0;"> in</span> <span style="color: #ff00ff;">`find source_data -iname "*.csv" -type f`</span>; <span style="color: #a020f0;">do</span> 
  <span style="color: #483d8b;">export</span> <span style="color: #a0522d;">target_file</span>=$(<span style="color: #ff00ff;">echo</span> $<span style="color: #a0522d;">f</span> | rev | cut -d<span style="color: #8b2252;">'.'</span> -f2- | rev).headless.csv
  tail +2 $<span style="color: #a0522d;">f</span> &gt; tmp
  mv tmp $<span style="color: #a0522d;">target_file</span>
<span style="color: #a020f0;">done</span>
</pre>
</div>

<p>
Create a file called `import.lite.sql`.
</p>

<div class="org-src-container">
<pre class="src src-sh">cat &lt;&lt;EOF &gt; import.lite.sql
<span style="color: #ffa54f;">drop table if exists characters;</span>

<span style="color: #ffa54f;">create table characters (</span>
<span style="color: #ffa54f;">character_id integer, </span>
<span style="color: #ffa54f;">name text</span>
<span style="color: #ffa54f;">);</span>

<span style="color: #ffa54f;">.mode csv</span>
<span style="color: #ffa54f;">.import source_data/characters.headless.csv characters</span>
<span style="color: #ffa54f;">EOF</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">
</pre>
</div>

<p>
Of course there is much more to the real import - let's take a look at
real-import.lite.sql
</p>

<div class="org-src-container">
<pre class="src src-sh">
</pre>
</div>

<p>
And now run it:
</p>

<div class="org-src-container">
<pre class="src src-sh">sqlite3 db.lite.sql &lt; real-import.lite.sql
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c0553d" class="outline-2">
<h2 id="org6c0553d"><span class="section-number-2">7</span> Basic SQL</h2>
<div class="outline-text-2" id="text-7">
<p>
We can run sqlite interactively by calling the command with our
database file.
</p>

<p>
What can we do?
</p>

<p>
First of all:
</p>

<ol class="org-ol">
<li>we can run SQL proper CREATE TABLE, SELECT, etc</li>
<li>we can configure sqlite (.mode, .header, etc)</li>
</ol>

<p>
So first of all
</p>
</div>
</div>

<div id="outline-container-org44e7b92" class="outline-2">
<h2 id="org44e7b92"><span class="section-number-2">8</span> SELECT</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-sh">sqlite3 db.lite.sql &lt;&lt;EOF
<span style="color: #ffa54f;">.mode columns</span>
<span style="color: #ffa54f;">.header on</span>
<span style="color: #ffa54f;">select </span>
<span style="color: #ffa54f;"> count(1) as number_created, </span>
<span style="color: #ffa54f;"> universe as universe,</span>
<span style="color: #ffa54f;"> year as year</span>
<span style="color: #ffa54f;"> from marvel_dc_characters </span>
<span style="color: #ffa54f;">group by universe, year</span>
<span style="color: #ffa54f;">having year &gt; 1979</span>
<span style="color: #ffa54f;">order by year asc</span>
<span style="color: #ffa54f;">limit 10</span>
<span style="color: #ffa54f;">EOF</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">number_created  universe    year      
--------------  ----------  ----------
293             DC          1980      
257             Marvel      1980      
346             DC          1981      
227             Marvel      1981      
327             DC          1982      
216             Marvel      1982      
354             DC          1983      
193             Marvel      1983      
365             DC          1984      
224             Marvel      1984      
</pre>
</div>

<p>
This isn't a super easy to read version of this data, so let's play
around a little more.
</p>

<div class="org-src-container">
<pre class="src src-sh">sqlite3 db.lite.sql &lt;&lt;EOF
<span style="color: #ffa54f;">.mode columns</span>
<span style="color: #ffa54f;">.header on</span>
<span style="color: #ffa54f;">select </span>
<span style="color: #ffa54f;"> sum(universe='DC') as dc_created, </span>
<span style="color: #ffa54f;"> sum(universe='Marvel') as marvel_created,</span>
<span style="color: #ffa54f;"> case </span>
<span style="color: #ffa54f;">  when sum(universe='DC') &gt; sum(universe='Marvel') then 'DC'</span>
<span style="color: #ffa54f;">  when sum(universe='Marvel') &gt; sum(universe='DC') then 'Marvel'</span>
<span style="color: #ffa54f;">  else 'tie'</span>
<span style="color: #ffa54f;"> end as 'more_productive',</span>
<span style="color: #ffa54f;"> year as year</span>
<span style="color: #ffa54f;"> from marvel_dc_characters </span>
<span style="color: #ffa54f;">group by year</span>
<span style="color: #ffa54f;">having year &gt; 1979</span>
<span style="color: #ffa54f;">order by year asc</span>
<span style="color: #ffa54f;">EOF</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">dc_created  marvel_created  more_productive  year      
----------  --------------  ---------------  ----------
293         257             DC               1980      
346         227             DC               1981      
327         216             DC               1982      
354         193             DC               1983      
365         224             DC               1984      
369         254             DC               1985      
379         247             DC               1986      
436         182             DC               1987      
590         304             DC               1988      
587         321             DC               1989      
532         357             DC               1990      
505         360             DC               1991      
633         455             DC               1992      
763         554             DC               1993      
715         485             DC               1994      
473         301             DC               1995      
494         306             DC               1996      
523         334             DC               1997      
417         274             DC               1998      
410         231             DC               1999      
474         322             DC               2000      
327         228             DC               2001      
426         311             DC               2002      
360         257             DC               2003      
384         282             DC               2004      
495         336             DC               2005      
684         381             DC               2006      
495         307             DC               2007      
571         360             DC               2008      
528         302             DC               2009      
603         324             DC               2010      
504         349             DC               2011      
206         201             DC               2012      
168         167             DC               2013      
884         815             DC                         
</pre>
</div>

<p>
Dumping this table to a file:
</p>

<div class="org-src-container">
<pre class="src src-sh">mkdir -p derived_data
sqlite3 db.lite.sql &lt;&lt;EOF
<span style="color: #ffa54f;">.headers on</span>
<span style="color: #ffa54f;">.mode csv</span>
<span style="color: #ffa54f;">.once derived_data/company_productivity.csv</span>
<span style="color: #ffa54f;">select </span>
<span style="color: #ffa54f;"> sum(universe='DC') as dc_created, </span>
<span style="color: #ffa54f;"> sum(universe='Marvel') as marvel_created,</span>
<span style="color: #ffa54f;"> case </span>
<span style="color: #ffa54f;">  when sum(universe='DC') &gt; sum(universe='Marvel') then 'DC'</span>
<span style="color: #ffa54f;">  when sum(universe='Marvel') &gt; sum(universe='DC') then 'Marvel'</span>
<span style="color: #ffa54f;">  else 'tie'</span>
<span style="color: #ffa54f;"> end as 'more_productive',</span>
<span style="color: #ffa54f;"> year as year</span>
<span style="color: #ffa54f;"> from marvel_dc_characters </span>
<span style="color: #ffa54f;">group by year</span>
<span style="color: #ffa54f;">order by year asc</span>
<span style="color: #ffa54f;">EOF</span>
head derived_data/company_productivity.csv
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">dc_created,marvel_created,more_productive,year
1,0,DC,1935
9,0,DC,1936
4,0,DC,1937
10,0,DC,1938
87,69,DC,1939
285,221,DC,1940
268,207,DC,1941
296,244,DC,1942
212,198,DC,1943
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc39003f" class="outline-2">
<h2 id="orgc39003f"><span class="section-number-2">9</span> Accessing SQLite from R</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>This is easy</li>
<li>Often much more convenient than working with SQLite directly.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb3b4906" class="outline-2">
<h2 id="orgb3b4906"><span class="section-number-2">10</span> Docker</h2>
<div class="outline-text-2" id="text-10">
<pre class="example">
RUN apt update -y &amp;&amp; apt-get install -y sqlite3
RUN R -e "install.packages('RSQLite');"
</pre>
</div>
</div>

<div id="outline-container-org6493eb4" class="outline-2">
<h2 id="org6493eb4"><span class="section-number-2">11</span> In R</h2>
<div class="outline-text-2" id="text-11">
<p>
Let's switch to an Rpres.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vincent</p>
<p class="date">Created: 2020-09-21 Mon 16:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
